Q1: What are missing values in a dataset? Why is it essential to handle missing values? Name some
algorithms that are not affected by missing values.

In datase some value is not fill and skip some data.

In real world data there is always have rough data not a systematic ways.

Because Many machine learning algorithms fail if the dataset contains missing values. this reasion why we essential to handle missing values.

k-NN and Random Forest algorithms is use to handle the missing value.

Q2: List down techniques used to handle missing data. Give an example of each with python code.

Type of techniques to handle missing data.

- median 
- mean
- mode

In [1]:
import seaborn as sns

In [3]:
df = sns.load_dataset('titanic')

In [4]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [10]:
df['age'].isnull

<bound method Series.isnull of 0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64>

In [11]:
df['age_mean'] = df['age'].fillna(df['age'].mean()) # this technique fill the nan value than given in age column

In [13]:
df.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_mean
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,27.000000
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,19.000000
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,29.699118
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,26.000000
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,32.000000

In [14]:
df['median_age'] = df['age'].fillna(df['age'].median())

In [16]:
df.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_mean,median_age
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,27.000000,27.0
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,19.000000,19.0
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,29.699118,28.0
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,26.000000,26.0
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,32.000000,32.0

In [28]:
mode = df[df['deck'].notna()]['deck'].mode()[0]

In [29]:
df['mode_deck'] = df['deck'].fillna(mode)

In [30]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_mean,median_age,mode_deck
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,22.0,22.0,C
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,38.0,38.0,C
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,26.0,26.0,C
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,35.0,35.0,C
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,35.0,35.0,C

Q3: Explain the imbalanced data. What will happen if imbalanced data is not handled?

A classification data set with skewed class proportions

If we not handle the imbalance data so, the result we tried to find is could be incorrect.

Q4: What are Up-sampling and Down-sampling? Explain with an example when up-sampling and down-
sampling are required.

Up-sampling - the process of inserting zero-valued samples between original samples to increase the sampling rate

Down-sampling - the act or process of making a digital signal smaller by lowering the number of bits per sample.

Up-sampling - if compact disc audio at 44,100 samples/second is upsampled by a factor of 5/4, the resulting sample-rate is 55,125.

Down-sampling - time signal of 10 seconds length, with a sample rate of 1024Hz or samples per second will have 10 x 1024 or 10240 samples.

Q5: What is data Augmentation? Explain SMOTE.

a process of artificially increasing the amount of data by generating new data points from existing data.

SMOTE is a statistical technique for increasing the number of cases in your dataset in a balanced way.

Q6: What are outliers in a dataset? Why is it essential to handle outliers?

an observation that lies an very large distance from other values in a random sample from a population.

If we not handle the outliers than they can have a large influence on statistics derived from the dataset and our result we want to find could we incorrect.

Q7: You are working on a project that requires analyzing customer data. However, you notice that some of
the data is missing. What are some techniques you can use to handle the missing data in your analysis?

There is many ways to handle the missing data :
    
    - take mean  , median  , mode 
    - delete rows and columns ( But this way is not a correct way because in this way many important data is delete when we delete the rows and columns  )

Q8: You are working with a large dataset and find that a small percentage of the data is missing. What are
some strategies you can use to determine if the missing data is missing at random or if there is a pattern
to the missing data?

If we work on large dataset and find a small percentage of the data is missing than we use ( MCAR , MNAR , MAR ) techniques to find the missing values , But when data is present in so large ammount and missing value is not to much compare with known value than we ignor the missing value , but if you want to know these value you use mean , median , mode to find the values to take a very accurate result.

Q9: Suppose you are working on a medical diagnosis project and find that the majority of patients in the
dataset do not have the condition of interest, while a small percentage do. What are some strategies you
can use to evaluate the performance of your machine learning model on this imbalanced dataset?

For doing Down-sampling on ( majority of patients in the dataset do not have the condition of interest )

We use some more strategies :
    
- Use metrics that are robust to class imbalance
- Use stratified sampling
- Resample the dataset
- Use cost-sensitive learning

Q10: When attempting to estimate customer satisfaction for a project, you discover that the dataset is
unbalanced, with the bulk of customers reporting being satisfied. What methods can you employ to
balance the dataset and down-sample the majority class?

- We use down-sampling the majority class 
- use PCA 
- use cluster

In [33]:
from sklearn.utils import resample

In [ ]:
down_sampling = resample(

    majority_class , #we give the majority class
    
    replace= False , # give repplace False for downsapling 
  
    n_samples= len(minority_class) ,
    
    random_state= 25
)

Q11: You discover that the dataset is unbalanced with a low percentage of occurrences while working on a
project that requires you to estimate the occurrence of a rare event. What methods can you employ to
balance the dataset and up-sample the minority class?

For balancing the imbalanced data we if data have very low percentage of occurrences we use up-sampling.

In [ ]:
up_sampling = resample(

    minority_class , #we give the minority class
    
    replace= True , # give repplace True for upsapling 
  
    n_samples= len(majority_class) ,
    
    random_state= 25
)